# ----------------------------------------------------------------------
# Tests: NLP - Stanza - Greek (Ancient)
# Copyright (C) 2018-2025  Ye Lei (叶磊)
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation, either version 3 of the License, or
# (at your option) any later version.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with this program.  If not, see <https://www.gnu.org/licenses/>.
# ----------------------------------------------------------------------

from tests.tests_nlp.tests_stanza import test_stanza

def test_stanza_grc():
    test_stanza.wl_test_stanza(
        lang = 'grc',
        results_sentence_tokenize = ['ἦλθον δὲ οἱ δύο ἄγγελοι εἰς Σόδομα ἑσπέρας·', 'Λὼτ δὲ ἐκάθητο παρὰ τὴν πύλην Σοδόμων.', 'ἰδὼν δὲ Λὼτ ἐξανέστη εἰς συνάντησιν αὐτοῖς καὶ προσεκύνησεν τῷ προσώπῳ ἐπὶ τὴν γῆν καὶ εἶπεν, ἰδού, κύριοι, ἐκκλίνατε εἰς τὸν οἶκον τοῦ παιδὸς ὑμῶν καὶ καταλύσατε καὶ νίψασθε τοὺς πόδας ὑμῶν, καὶ ὀρθρίσαντες ἀπελεύσεσθε εἰς τὴν ὁδὸν ὑμῶν.', 'εἶπαν δέ, οὐχί, ἀλλ᾿ ἐν τῇ πλατείᾳ καταλύσομεν.'],
        results_word_tokenize = ['ἦλθον', 'δὲ', 'οἱ', 'δύο', 'ἄγγελοι', 'εἰς', 'Σόδομα', 'ἑσπέρας', '·', 'Λὼτ', 'δὲ', 'ἐκάθητο', 'παρὰ', 'τὴν', 'πύλην', 'Σοδόμων', '.', 'ἰδὼν', 'δὲ', 'Λὼτ', 'ἐξανέστη', 'εἰς', 'συνάντησιν', 'αὐτοῖς', 'καὶ', 'προσεκύνησεν', 'τῷ', 'προσώπῳ', 'ἐπὶ', 'τὴν', 'γῆν'],
        results_pos_tag = [('ἦλθον', 'v1paia---'), ('δὲ', 'd--------'), ('οἱ', 'l-p---mn-'), ('δύο', 'm--------'), ('ἄγγελοι', 'n-p---mn-'), ('εἰς', 'r--------'), ('Σόδομα', 'n-s---fa-'), ('ἑσπέρας', 'n-p---fa-'), ('·', 'u--------'), ('Λὼτ', 'n-s---mn-'), ('δὲ', 'd--------'), ('ἐκάθητο', 'v3slie---'), ('παρὰ', 'r--------'), ('τὴν', 'l-s---fa-'), ('πύλην', 'n-s---fa-'), ('Σοδόμων', 'n-s---mn-'), ('.', 'u--------'), ('ἰδὼν', 'v-sapamn-'), ('δὲ', 'd--------'), ('Λὼτ', 'n-s---ma-'), ('ἐξανέστη', 'v3saia---'), ('εἰς', 'r--------'), ('συνάντησιν', 'n-s---fa-'), ('αὐτοῖς', 'p-p---md-'), ('καὶ', 'c--------'), ('προσεκύνησεν', 'v3saia---'), ('τῷ', 'l-s---nd-'), ('προσώπῳ', 'n-s---nd-'), ('ἐπὶ', 'r--------'), ('τὴν', 'l-s---fa-'), ('γῆν', 'n-s---fa-')],
        results_pos_tag_universal = [('ἦλθον', 'VERB'), ('δὲ', 'ADV'), ('οἱ', 'DET'), ('δύο', 'NUM'), ('ἄγγελοι', 'NOUN'), ('εἰς', 'ADP'), ('Σόδομα', 'NOUN'), ('ἑσπέρας', 'NOUN'), ('·', 'PUNCT'), ('Λὼτ', 'NOUN'), ('δὲ', 'ADV'), ('ἐκάθητο', 'VERB'), ('παρὰ', 'ADP'), ('τὴν', 'DET'), ('πύλην', 'NOUN'), ('Σοδόμων', 'NOUN'), ('.', 'PUNCT'), ('ἰδὼν', 'VERB'), ('δὲ', 'ADV'), ('Λὼτ', 'NOUN'), ('ἐξανέστη', 'VERB'), ('εἰς', 'ADP'), ('συνάντησιν', 'NOUN'), ('αὐτοῖς', 'PRON'), ('καὶ', 'CCONJ'), ('προσεκύνησεν', 'VERB'), ('τῷ', 'DET'), ('προσώπῳ', 'NOUN'), ('ἐπὶ', 'ADP'), ('τὴν', 'DET'), ('γῆν', 'NOUN')],
        results_lemmatize = ['ἔρχομαι', 'δέ', 'ὁ', 'δύο', 'ἄγγελος', 'εἰς', 'Σόδομα', 'ἵσπερα', '·', 'Λώς', 'δέ', 'κάθημαι', 'παρά', 'ὁ', 'πύλη', 'Σόδομος', '.', 'εἶδον', 'δέ', 'Λώς', 'ἐξανίστημι', 'εἰς', 'συνάντησις', 'αὐτός', 'καί', 'προσκυνέω', 'ὁ', 'πρόσωπον', 'ἐπί', 'ὁ', 'γῆ'],
        results_dependency_parse = [('ἦλθον', 'ἦλθον', 'root', 0), ('δὲ', 'ἦλθον', 'advmod', -1), ('οἱ', 'ἄγγελοι', 'det', 2), ('δύο', 'ἄγγελοι', 'nummod', 1), ('ἄγγελοι', 'ἦλθον', 'nsubj', -4), ('εἰς', 'ἑσπέρας', 'case', 2), ('Σόδομα', 'ἑσπέρας', 'nmod', 1), ('ἑσπέρας', 'ἦλθον', 'obl', -7), ('·', 'ἦλθον', 'punct', -8), ('Λὼτ', 'ἐκάθητο', 'nsubj', 2), ('δὲ', 'ἐκάθητο', 'advmod', 1), ('ἐκάθητο', 'ἐκάθητο', 'root', 0), ('παρὰ', 'πύλην', 'case', 2), ('τὴν', 'πύλην', 'det', 1), ('πύλην', 'ἐκάθητο', 'obl', -3), ('Σοδόμων', 'ἐκάθητο', 'nsubj', -4), ('.', 'ἐκάθητο', 'punct', -5), ('ἰδὼν', 'ἐξανέστη', 'advcl', 3), ('δὲ', 'ἐξανέστη', 'advmod', 2), ('Λὼτ', 'ἰδὼν', 'obj', -2), ('ἐξανέστη', 'ἐξανέστη', 'root', 0), ('εἰς', 'συνάντησιν', 'case', 1), ('συνάντησιν', 'ἐξανέστη', 'obl', -2), ('αὐτοῖς', 'ἐξανέστη', 'iobj', -3), ('καὶ', 'ἐξανέστη', 'cc', -4), ('προσεκύνησεν', 'ἐξανέστη', 'conj', -5), ('τῷ', 'προσώπῳ', 'det', 1), ('προσώπῳ', 'προσεκύνησεν', 'obl', -2), ('ἐπὶ', 'γῆν', 'case', 2), ('τὴν', 'γῆν', 'det', 1), ('γῆν', 'προσεκύνησεν', 'obl', -5)]
    )

if __name__ == '__main__':
    test_stanza_grc()
