#
# Wordless: Mapping Table (HanLP Tagset -> Universal POS Tags)
#
# Copyright (C) 2018 Ye Lei (叶磊) <blkserene@gmail.com>
#
# License Information: https://github.com/BLKSerene/Wordless/blob/master/LICENSE.txt
#

#
# HanLP Tagset: http://www.hankcs.com/nlp/part-of-speech-tagging.html
#
# Universal POS Tags: http://universaldependencies.org/u/pos/all.html
#

mappings = [
    ['a', 'ADJ', '形容词', ''],
    ['ad', 'ADJ', '副形词', ''],
    ['ag', 'ADJ', '形容词性语素', ''],
    ['al', 'ADJ', '形容词性惯用语', ''],
    ['an', 'ADJ', '名形词', ''],

    ['b', 'PART', '区别词', ''],
    ['begin', 'X', '仅用于始', ''],
    ['bg', 'PART', '区别语素', ''],
    ['bl', 'PART', '区别词性惯用语', ''],

    ['c', 'CCONJ/SCONJ', '连词', ''],
    ['cc', 'CCONJ', '并列连词', ''],

    ['d', 'ADV', '副词', ''],
    ['dg', 'ADV', '辄、俱、复之类的副词', '辄, 俱, 复'],
    ['dl', 'CCONJ/SCONJ', '连语', ''],

    ['e', 'INTJ', '叹词', ''],
    ['end', 'X', '仅用于终', ''],

    ['f', 'PART', '方位词', ''],

    ['g', 'X', '学术词汇', ''],
    ['gb', 'X', '生物相关词汇', ''],
    ['gbc', 'X', '生物类别', ''],
    ['gc', 'X', '化学相关词汇', ''],
    ['gg', 'X', '地理地质相关词汇', ''],
    ['gi', 'X', '计算机相关词汇', ''],
    ['gm', 'X', '数学相关词汇', ''],
    ['gp', 'X', '物理相关词汇', ''],

    ['h', 'PART', '前缀', ''],

    ['i', 'X', '成语', ''],

    ['j', 'X', '简称、略语', ''],

    ['k', 'PART', '后缀', ''],

    ['l', 'X', '习用语', ''],

    ['m', 'NUM', '数词', ''],
    ['Mg', 'NUM', '数语素', ''],
    ['mg', 'NUM', '甲乙丙丁之类的数词', '甲, 乙, 丙, 丁'],
    ['mq', 'NUM', '数量词', ''],

    ['n', 'NOUN', '名词', ''],
    ['nb', 'NOUN', '生物名', ''],
    ['nba', 'NOUN', '动物名', ''],
    ['nbc', 'PROPN', '动物纲目', ''],
    ['nbp', 'NOUN', '植物名', ''],
    ['nf', 'NOUN', '食品', '薯片'],
    ['ng', 'NOUN', '名词性语素', ''],
    ['nh', 'NOUN', '医药疾病等健康相关名词', ''],
    ['nhd', 'NOUN', '疾病', ''],
    ['nhm', 'NOUN', '药品', ''],
    ['ni', 'PROPN', '机构相关（不是独立机构名）', ''],
    ['nic', 'PROPN', '下属机构', ''],
    ['nis', 'PROPN', '机构后缀', ''],
    ['nit', 'PROPN', '教育相关机构', ''],
    ['nl', 'NOUN', '名词性惯用语', ''],
    ['nm', 'NOUN', '物品名', ''],
    ['nmc', 'NOUN', '化学品名', ''],
    ['nn', 'NOUN', '工作相关名词', ''],
    ['nnd', 'NOUN', '职业', ''],
    ['nnt', 'NOUN', '职务职称', ''],
    ['nr', 'PROPN', '人名', ''],
    ['nr1', 'PROPN', '复姓', ''],
    ['nr2', 'PROPN', '蒙古姓名', ''],
    ['nrf', 'PROPN', '音译人名', ''],
    ['nrj', 'PROPN', '日语人名', ''],
    ['ns', 'PROPN', '地名', ''],
    ['nsf', 'PROPN', '音译地名', ''],
    ['nt', 'PROPN', '机构团体名', ''],
    ['ntc', 'PROPN', '公司名', ''],
    ['ntcb', 'PROPN', '银行', ''],
    ['ntcf', 'PROPN', '工厂', ''],
    ['ntch', 'PROPN', '酒店宾馆', ''],
    ['nth', 'PROPN', '医院', ''],
    ['nto', 'PROPN', '政府机构', ''],
    ['nts', 'PROPN', '中小学', ''],
    ['ntu', 'PROPN', '大学', ''],
    ['nx', 'PROPN', '字母专名', ''],
    ['nz', 'PROPN', '其他专名', ''],

    ['o', 'X', '拟声词', ''],

    ['p', 'ADP', '介词', ''],
    ['pba', 'ADP', '介词“把”', ''],
    ['pbei', 'ADP', '介词“被”', ''],

    ['q', 'NUM', '量词', ''],
    ['qg', 'NUM', '量词语素', ''],
    ['qt', 'NUM', '时量词', ''],
    ['qv', 'NUM', '动量词', ''],

    ['r', 'PRON', '代词', ''],
    ['Rg', 'PRON', '代词性语素', ''],
    ['rg', 'PRON', '古汉语代词性语素', ''],
    ['rr', 'PRON', '人称代词', ''],
    ['ry', 'PRON', '疑问代词', ''],
    ['rys', 'PRON', '处所疑问代词', ''],
    ['ryt', 'PRON', '时间疑问代词', ''],
    ['ryv', 'PRON', '谓词性疑问代词', ''],
    ['rz', 'PRON', '指示代词', ''],
    ['rzs', 'PRON', '处所指示代词', ''],
    ['rzt', 'PRON', '时间指示代词', ''],
    ['rzv', 'PRON', '谓词性指示代词', ''],

    ['s', 'PART', '处所词', ''],

    ['t', 'PART', '时间词', ''],
    ['tg', 'PART', '时间词性语素', ''],

    ['u', 'PART', '助词', ''],
    ['ud', 'PART', '助词', ''],
    ['ude1', 'PART', '的', ''],
    ['ude2', 'PART', '地', ''],
    ['ude3', 'PART', '得', ''],
    ['udent', 'PART', '等、等等、云云', ''],
    ['udh', 'PART', '的话', ''],
    ['ug', 'PART', '过', ''],
    ['uguo', 'PART', '过', ''],
    ['uj', 'PART', '助词', ''],
    ['ul', 'CCONJ/SCONJ', '连词', ''],
    ['ule', 'PART', '了、喽', ''],
    ['ulian', 'PART', '连（连小学生都会）', ''],
    ['uls', 'PART', '来讲、来说、而言、说来', ''],
    ['usuo', 'PART', '所', ''],
    ['uv', 'CCONJ/SCONJ', '连词', ''],
    ['uyy', 'PART', '一样、一般、似的、般', ''],
    ['uz', 'PART', '着', ''],
    ['uzhe', 'PART', '着', ''],
    ['uzhi', 'PART', '之', ''],

    ['v', 'VERB', '动词', ''],
    ['vd', 'VERB', '副动词', ''],
    ['vf', 'VERB', '趋向动词', ''],
    ['vg', 'VERB', '动词性语素', ''],
    ['vi', 'VERB', '不及物动词（内动词）', ''],
    ['vl', 'VERB', '动词性惯用语', ''],
    ['vn', 'VERB', '名动词', ''],
    ['vshi', 'VERB', '动词“是”', ''],
    ['vx', 'VERB', '形式动词', ''],
    ['vyou', 'VERB', '动词“有”', ''],

    ['w', 'PUNCT', '标点符号', ''],
    ['wb', 'SYM', '百分号、千分号', '％ % ‰'],
    ['wd', 'PUNCT', '逗号', '， ,'],
    ['wf', 'PUNCT', '分号', '； ;'],
    ['wh', 'SYM', '单位符号', '￥ ＄ $ ￡ ° ℃'],
    ['wj', 'PUNCT', '句号', '。'],
    ['wky', 'PUNCT', '右括号', '） ) 〕 ］ ] ｝ } 》 】 〗 〉 >'],
    ['wjz', 'PUNCT', '左括号', '（ ( 〔 ［ [ ｛ { 《 【 〖 〈 <'],
    ['wm', 'PUNCT', '冒号', '： :'],
    ['wn', 'PUNCT', '顿号', '、'],
    ['wp', 'PUNCT', '破折号', '—— — －－ － – -'],
    ['ws', 'PUNCT', '省略号', '…… …'],
    ['wt', 'PUNCT', '叹号', '！'],
    ['ww', 'PUNCT', '问号', '？'],
    ['wyy', 'PUNCT', '右引号', '” ’ 』'],
    ['wyz', 'PUNCT', '左引号', '“ ‘ 『'],

    ['x', 'SYM', '字符串', ''],
    ['xu', 'SYM', '网址URL', ''],
    ['xx', 'X', '非语素词', ''],

    ['y', 'PART', '语气词', ''],
    ['yg', 'PART', '语气语素', ''],

    ['z', 'PART', '状态词', ''],
    ['zg', 'PART', '状态词', ''],
]
